---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.AllMullionsAreTooShort
source: html/8613fba9-4ca4-6acd-2c08-d254f8e6bf54.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.AllMullionsAreTooShort Property

The mullion(s) you are trying to place is too short for his type, and was not placed on the grid.

## Syntax (C#)
```csharp
public static FailureDefinitionId AllMullionsAreTooShort { get; }
```